# First print your name in the cell below then save this file. (or something nice about your instructor)

In [3]:
# In this cell print your name 

print("Lin Htet Aung")

Lin Htet Aung

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [4]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [5]:
# Load data here

df = pd.read_csv('../data/listings.csv')

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [6]:
# 1. How many listings are there with a price less than 100? 
c1 = df['price'] < 100

# new_ls = df[c1].neighbourhood_group.value_counts

df_low_price = df[c1].copy()

df_low_price.shape

(22778, 16)

In [9]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.
c2 = df['neighbourhood'] == 'Brooklyn'
df_bk = df[c2].copy()

df_bk.shape

(0, 16)

In [ ]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.

c3 = c1 & c2

combined_filter_ls = df[c3]

combined_filter_ls.shape

(10473, 16)

In [ ]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names

host_names = ['Michael', 'Davide', 'John', 'Daniel']

condition = df.host_name.isin(host_names)

df[condition]['host_name'].value_counts()

host_name
Michael    387
John       270
Daniel     253
Davide       3
Name: count, dtype: int64

In [ ]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 


c1 = df['neighbourhood'] == 'Williamsburg'

df['adjusted_price'] = np.where(c1, df['price'] + 100, df['price'])

<bound method DataFrame.info of              id                                               name    host_id  \
0          2595                              Skylit Midtown Castle       2845
1          3831  Whole flr w/private bdrm, bath & kitchen(pls r...       4869
2          5121                                    BlissArtsSpace!       7356
3          5136           Spacious Brooklyn Duplex, Patio + Garden       7378
4          5178                   Large Furnished Room Near B'way　       8967
...         ...                                                ...        ...
46522  44807522         Designer Gramercy Studio Townhouse by UNSQ   12941925
46523  44807786  Cozy & comfy apt in the heart of Inwood Manhattan  284790520
46524  44811717  Comfortable safe environment 24hr security camera  362453686
46525  44814944                 Upper West Side studio 86th Street    4039777
46526  44818009  5MIN D/N trains, NEAR THE BEACH, 50’ TO MANHATTAN   48098268

         host_name neighbourhood_group       neighbourhood  latitude  \
0         Jennifer           Manhattan             Midtown  40.75362
1      LisaRoxanne            Brooklyn        Clinton Hill  40.68514
2            Garon            Brooklyn  Bedford-Stuyvesant  40.68688
3          Rebecca            Brooklyn         Sunset Park  40.66120
4         Shunichi           Manhattan      Hell's Kitchen  40.76489
...            ...                 ...                 ...       ...
46522        Brian           Manhattan            Gramercy  40.73433
46523        Salar           Manhattan  Washington Heights  40.85820
46524       Nicole            Brooklyn       East Flatbush  40.65399
46525     Fernando           Manhattan     Upper West Side  40.78731
46526       Marina            Brooklyn           Gravesend  40.59945

       longitude        room_type  price  minimum_nights  number_of_reviews  \
0      -73.98377  Entire home/apt    175               3                 48
1      -73.95976  Entire home/apt     75               1                340
2      -73.95596     Private room     60              29                 50
3      -73.99423  Entire home/apt    175              14                  1
4      -73.98493     Private room     65               2                473
...          ...              ...    ...             ...                ...
46522  -73.98383  Entire home/apt    145               7                  0
46523  -73.92733  Entire home/apt     87               6                  0
46524  -73.93287     Private room     59               3                  0
46525  -73.97029  Entire home/apt     80              30                  0
46526  -73.98209     Private room     66               1                  0

      last_review  reviews_per_month  calculated_host_listings_count  \
0      2019-11-04               0.37                               2
1      2020-08-01               4.75                               1
2      2019-12-02               0.37                               1
3      2014-01-02               0.01                               1
4      2020-03-15               3.44                               1
...           ...                ...                             ...
46522         NaN                NaN                               1
46523         NaN                NaN                               2
46524         NaN                NaN                               1
46525         NaN                NaN                               1
46526         NaN                NaN                               1

       availability_365  adjusted_price
0                   365             175
1                   265              75
2                   365              60
3                   295             175
4                   340              65
...                 ...             ...
46522               164             145
46523                85              87
46524                90              59
46525               113              80
46526                38              66

[46527 rows x 17 columns]>

In [ ]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  
gbo = df.groupby('room_type')

# gbo.value_counts()

df.room_type.value_counts()
df.room_type.value_counts(normalize=True)

room_type
Entire home/apt    0.515787
Private room       0.454446
Shared room        0.021213
Hotel room         0.008554
Name: proportion, dtype: float64

In [ ]:
df.room_type.value_counts(normalize=True)

room_type
Entire home/apt    0.515787
Private room       0.454446
Shared room        0.021213
Hotel room         0.008554
Name: proportion, dtype: float64

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [ ]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

group_by_object = df.groupby('neighbourhood_group')
print(group_by_object)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7698481e26c0>

In [ ]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 
group_by_object = df.groupby('neighbourhood_group')
group_by_object['price'].mean()

neighbourhood_group
Bronx             92.751479
Brooklyn         120.225258
Manhattan        191.880466
Queens            99.754965
Staten Island    110.947214
Name: price, dtype: float64

In [ ]:
# 2.5. Using `groupby`, find the mean price for each room_type. 
gbo = df.groupby('room_type')

gbo['price'].mean()

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [ ]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 

group_by_object = df.groupby('neighbourhood_group')
group_by_object['price'].agg(['max', 'min'])

                       max  min
neighbourhood_group
Bronx                 1404   16
Brooklyn             10000    0
Manhattan            10000    0
Queens               10000    0
Staten Island         1200   19

In [ ]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.

gbo = df.groupby('room_type')

gbo['price'].mean()

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [ ]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.

gbo = df.groupby('room_type')

gbo['price'].agg(['count', 'min', 'max', 'mean', 'std', 'sum'])

                 count  min    max        mean         std      sum
room_type
Entire home/apt  23998    0  10000  199.395950  337.657116  4785104
Hotel room         398    0   2211  275.015075  301.658021   109456
Private room     21144   10  10000   91.453084  282.450148  1933684
Shared room        987   10  10000   87.063830  354.048373    85932

# Load, Merge, and Export files.
1. Load the `prices.csv` and the `n_listings.csv`
    * Having an error..? Inspect the actual csv file if you're having trouble

2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']

       
3. Save your joined csv as `joined.csv` into the data folder. 


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [ ]:
# 1. Load the `prices.csv` and the `n_listings.csv`

df_prices = pd.read_csv('../data/prices.csv', index_col='neighbourhood_group')

df_n_listings = pd.read_csv('../data/n_listings.csv',sep=';' ,index_col='neighbourhood_group')

                      mean_price  n_listings
neighbourhood_group
Bronx                  92.751479      1183.0
Brooklyn              120.225258     18632.0
Manhattan             191.880466     20580.0
Queens                 99.754965         NaN
Staten Island         110.947214         NaN

In [ ]:
# 2. Do join that keeps all the records for each table.

# df_joined = df_prices.join(df_n_listings) 
df_joined = df_n_listings.join(df_prices, how="outer")
df_joined

                     n_listings   mean_price
neighbourhood_group
Bronx                    1183.0    92.751479
Brooklyn                18632.0   120.225258
LongIsland               4121.0          NaN
Manhattan               20580.0   191.880466
Queens                      NaN    99.754965
Staten Island               NaN   110.947214

In [ ]:
# 3. Save your joined csv as `joined.csv` into the data folder. 

# This is the name of your new file
save_as = 'joined.csv'

df_joined.to_csv(save_as)

In [ ]:
# 4. Load your newly saved file, see if it looks the same.  If not, try saving with argument `index=False`

saved_df = pd.read_csv('joined.csv')

saved_df

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479      1183.0
1            Brooklyn   120.225258     18632.0
2           Manhattan   191.880466     20580.0
3              Queens    99.754965         NaN
4       Staten Island   110.947214         NaN

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.